TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СРПВТранспортныеДокументыЖДПолученные/гкс_СРПВТранспортныеДокументыЖДПолученные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СРПВТранспортныеДокументыЖДПолученные</name>
  <attributes>
    <name>ДатаПрибытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Подобран</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВагона</name>
    <type>
      <types>DefinedType.гкс_НомерВагона</types>
    </type>
  </attributes>
  <attributes>
    <name>Зарегистрирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>КлючАналитикиСРПВ</name>
    <comment>Идентификатор отправки</comment>
    <type>
      <types>CatalogRef.гкс_КлючиАналитикиСРПВ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Прибытие</name>
    <type>
      <types>DocumentRef.гкс_СРПВПрибытиеНаПуть</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортныйДокумент</name>
    <type>
      <types>DocumentRef.гкс_ТранспортныйДокумент</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СРПВСтатусыОформленияВагонов/гкс_СРПВСтатусыОформленияВагонов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СРПВСтатусыОформленияВагонов</name>
  <resources>
    <name>Документ</name>
    <type>
      <types>DocumentRef.гкс_Взвешивание</types>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерВагона</name>
    <type>
      <types>DefinedType.гкс_НомерВагона</types>
    </type>
  </attributes>
  <attributes>
    <name>Оформлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>КлючАналитикиСРПВ</name>
    <type>
      <types>CatalogRef.гкс_КлючиАналитикиСРПВ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>DefinedType.гкс_ДокументыСРПВ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.гкс_СРПВСтатусыВагонов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СвязьРегистрацииИТранспортногоДокумента/гкс_СвязьРегистрацииИТранспортногоДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СвязьРегистрацииИТранспортногоДокумента</name>
  <comment>Транспортные документы регистрации</comment>
  <resources>
    <name>ТранспортныйДокумент</name>
    <type>
      <types>DocumentRef.гкс_ТранспортныйДокумент</types>
    </type>
  </resources>
  <resources>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </resources>
  <resources>
    <name>ЗаявкаНаПеревозку</name>
    <type>
      <types>DocumentRef.гкс_ЗаявкаНаПеревозку</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СостоянияРегистрации/гкс_СостоянияРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СостоянияРегистрации</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.гкс_СостоянияРегистрации</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипРегистрации/гкс_ТипРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипРегистрации</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыТранспортныхСредствДоставки/гкс_ТипыТранспортныхСредствДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыТранспортныхСредствДоставки</name>
  <enumValues>
    <name>Автомобиль</name>
  </enumValues>
  <enumValues>
    <name>Судно</name>
  </enumValues>
  <enumValues>
    <name>ЖДТранспорт</name>
  </enumValues>
  <enumValues>
    <name>Самолёт</name>
  </enumValues>
  <enumValues>
    <name>БезДоставки</name>
  </enumValues>
  <enumValues>
    <name>Трубопровод</name>
  </enumValues>
  <enumValues>
    <name>Контейнер</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_НазначенияИспользованияКачества/гкс_НазначенияИспользованияКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_НазначенияИспользованияКачества</name>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаКомпозит</name>
  </enumValues>
  <enumValues>
    <name>ЭлеваторВнешниеПробы</name>
  </enumValues>
  <enumValues>
    <name>ЛаборантВнешниеПробы</name>
  </enumValues>
  <enumValues>
    <name>КомпозитВнешниеПробыНаТысячуТон</name>
  </enumValues>
  <enumValues>
    <name>ПромежуточныйКомпозит</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныйАнализ</name>
  </enumValues>
  <enumValues>
    <name>ПерепроверкаВнешнихПроб</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_СостоянияРегистрации/гкс_СостоянияРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_СостоянияРегистрации</name>
  <enumValues>
    <name>Прибыл</name>
  </enumValues>
  <enumValues>
    <name>ВзвешенБрутто</name>
  </enumValues>
  <enumValues>
    <name>НеПринятоПоПревышениюМаксимальногоВеса</name>
  </enumValues>
  <enumValues>
    <name>Регистрация</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОтборуПроб</name>
  </enumValues>
  <enumValues>
    <name>ВзятыПробы</name>
  </enumValues>
  <enumValues>
    <name>РезультатыПробПолучены</name>
  </enumValues>
  <enumValues>
    <name>КачествоПринято</name>
  </enumValues>
  <enumValues>
    <name>КачествоНеПринято</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаРазрешена</name>
  </enumValues>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>ВзвешенТара</name>
  </enumValues>
  <enumValues>
    <name>Убыл</name>
  </enumValues>
  <enumValues>
    <name>НеПринято</name>
  </enumValues>
  <enumValues>
    <name>ПринятыПробы</name>
  </enumValues>
  <enumValues>
    <name>ПогрузкаРазрешена</name>
    <comment>ERP-2029</comment>
  </enumValues>
  <enumValues>
    <name>Погружен</name>
    <comment>ERP-2029</comment>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_СРПВСтатусыВагонов/гкс_СРПВСтатусыВагонов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_СРПВСтатусыВагонов</name>
  <enumValues>
    <name>Прибыл</name>
  </enumValues>
  <enumValues>
    <name>ВзвешенБрутто</name>
  </enumValues>
  <enumValues>
    <name>ВзвешенТара</name>
  </enumValues>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>Погружен</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_РегистрацияНаПЛК/гкс_РегистрацияНаПЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_РегистрацияНаПЛК</name>
  <basedOn>Document.гкс_ВъездНаКПП</basedOn>
  <registerRecords>AccumulationRegister.гкс_СДИЗНаПЛК</registerRecords>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесНетто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>DocumentRef.гкс_СпецификацияКДоговоруКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительПолучатель</name>
    <comment>Для приёмки Грузоотправитель, для отправки Грузополучатель</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаПоставщика</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Внутригрупповой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Собственник</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаВъезда</name>
    <comment>Точка маршрута для определения проезда</comment>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDEPC</name>
    <type>
      <types>DefinedType.RFIDEPC</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDTID</name>
    <type>
      <types>DefinedType.RFIDTID</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ИДРейса</name>
    <comment>ERP-2176</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияВеса</name>
    <comment>Ед.измерения веса в документе</comment>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗоныКарантинногоКонтроля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗоныКарантинногоКонтроляСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесоваяВъезда</name>
    <type>
      <types>CatalogRef.гкс_СтруктураПЛК</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеПроезда</name>
    <type>
      <types>CatalogRef.гкс_УсловияПроезда</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПогрузки</name>
    <type>
      <types>CatalogRef.гкс_СтруктураПЛК</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаОтгрузкуПродукции</name>
    <type>
      <types>DocumentRef.гкс_ЗаявкаНаОтгрузкуПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгрузкаСОдногоБорта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.гкс_ПрибытиеСуднаНаПЛК</types>
      <types>DocumentRef.гкс_ЗаписьВОчередьПриемкиПЛК</types>
      <types>DocumentRef.гкс_ВъездНаКПП</types>
      <types>DocumentRef.гкс_СРПВПрибытиеНаПуть</types>
    </type>
  </attributes>
  <attributes>
    <name>СДИЗ</name>
    <type>
      <types>CatalogRef.гкс_СДИЗЗЕРНО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктПогрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокументаОснования</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/CommonModules/гкс_УчетВагоновСРПВ/Module.bsl
// @strict-types

#Область ПрограммныйИнтерфейс

// Возвращает значение ФО - Используется интеграция СРПВ.
// 
// Возвращаемое значение:
//  Булево - Используется интеграция СРПВ
//
Функция ИспользуетсяИнтеграцияСРПВ() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("гкс_ИспользоватьИнтеграциюСРПВ");
	
КонецФункции

// Возвращает значение ФО - Используется обмен доступными местами разгрузки СРПВ.
// 
// Возвращаемое значение:
//  Булево - Используется обмен доступными местами разгрузки СРПВ.
//
Функция ИспользуетсяОбменДоступнымиМестамиРазгрузкиСРПВ() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("гкс_ИспользоватьОбменДоступнымиМестамиРазгрузкиСРПВ");
	
КонецФункции

// Возвращает признак регистрации вагона в контуре документов ПЛК.
// 
// Параметры:
//  КлючАналитикиСРПВ	- СправочникСсылка.гкс_КлючиАналитикиСРПВ - ссылка на ключ аналитики СРПВ.
// 
// Возвращаемое значение:
//  Булево - если Истина, документ "Регистрация на ПЛК" уже создан.
//
Функция ВагонЗарегистрирован(КлючАналитикиСРПВ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТранспортныеДокументыЖДПолученные.КлючАналитикиСРПВ КАК КлючАналитикиСРПВ
	|ИЗ
	|	РегистрСведений.гкс_СРПВТранспортныеДокументыЖДПолученные КАК ТранспортныеДокументыЖДПолученные
	|ГДЕ
	|	ТранспортныеДокументыЖДПолученные.КлючАналитикиСРПВ = &КлючАналитикиСРПВ
	|	И ТранспортныеДокументыЖДПолученные.Зарегистрирован";
	
	Запрос.УстановитьПараметр("КлючАналитикиСРПВ", КлючАналитикиСРПВ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

// Проверяет условие готовности создания документа "Регистрация на ПЛК" для прибывшего вагона.
// 
// Параметры:
//  Прибытие	- ДокументСсылка.гкс_СРПВПрибытиеНаПуть - ссылка на документ прибытия на путь.
// 
// Возвращаемое значение:
//  Булево - Истина, если условие проверки выполняется.
//
Функция ВагонГотовКРегистрации(Прибытие) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТранспортныеДокументыЖДПолученные.КлючАналитикиСРПВ КАК КлючАналитикиСРПВ
	|ИЗ
	|	РегистрСведений.гкс_СРПВТранспортныеДокументыЖДПолученные КАК ТранспортныеДокументыЖДПолученные
	|ГДЕ
	|	ТранспортныеДокументыЖДПолученные.Прибытие = &Прибытие
	|	И ТранспортныеДокументыЖДПолученные.Подобран = ИСТИНА
	|	И ТранспортныеДокументыЖДПолученные.Зарегистрирован = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Прибытие", Прибытие);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

// Возвращает признак оформления документа в контуре документов ПЛК.
// 
// Параметры:
//  КлючАналитикиСРПВ	- СправочникСсылка.гкс_КлючиАналитикиСРПВ - ссылка на ключ аналитики СРПВ.
//  Основание	- ОпределяемыйТип.гкс_ДокументыСРПВ - ссылка на документ по данным из СРПВ.
// 
// Возвращаемое значение:
//  Булево - Истина, если документ оформлен.
//
Функция НаВагонОформленДокументОперации(КлючАналитикиСРПВ, Основание) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыОформленияВагонов.КлючАналитикиСРПВ КАК КлючАналитикиСРПВ
	|ИЗ
	|	РегистрСведений.гкс_СРПВСтатусыОформленияВагонов КАК СтатусыОформленияВагонов
	|ГДЕ
	|	СтатусыОформленияВагонов.КлючАналитикиСРПВ = &КлючАналитикиСРПВ
	|	И СтатусыОформленияВагонов.Основание = &Основание
	|	И СтатусыОформленияВагонов.Оформлен";
	
	Запрос.УстановитьПараметр("КлючАналитикиСРПВ", КлючАналитикиСРПВ);
	Запрос.УстановитьПараметр("Основание", Основание);

	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

// Возвращает признак оформления документа в контуре документов ПЛК.
// 
// Параметры:
//  КлючАналитикиСРПВ	- СправочникСсылка.гкс_КлючиАналитикиСРПВ - ссылка на ключ аналитики СРПВ.
//  СтатусВагона	- ПеречислениеСсылка.гкс_СРПВСтатусыВагонов - статус вагона СРПВ.
// 
// Возвращаемое значение:
//  Булево - Истина, если документ оформлен.
//
Функция НаСтатусОформленДокументОперации(КлючАналитикиСРПВ, СтатусВагона) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыОформленияВагонов.КлючАналитикиСРПВ КАК КлючАналитикиСРПВ
	|ИЗ
	|	РегистрСведений.гкс_СРПВСтатусыОформленияВагонов КАК СтатусыОформленияВагонов
	|ГДЕ
	|	СтатусыОформленияВагонов.КлючАналитикиСРПВ = &КлючАналитикиСРПВ
	|	И СтатусыОформленияВагонов.Статус = &Статус
	|	И СтатусыОформленияВагонов.Оформлен";
	
	Запрос.УстановитьПараметр("КлючАналитикиСРПВ", КлючАналитикиСРПВ);
	Запрос.УстановитьПараметр("Статус", СтатусВагона);

	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

// Возвращает запись об оформлении по статусу вагона и ключу аналитики СРПВ.
// 
// Параметры:
//  КлючАналитикиСРПВ	- СправочникСсылка.гкс_КлючиАналитикиСРПВ - ссылка на ключ аналитики СРПВ.
//  СтатусВагона	- ПеречислениеСсылка.гкс_СРПВСтатусыВагонов - статус вагона СРПВ.
// 
// Возвращаемое значение:
//  Структура - со свойствами:
//     * Документ 	- ДокументСсылка.гкс_Взвешивание -
//					- ДокументСсылка.гкс_РегистрацияНаПЛК - докумен в контуре документов ПЛК
//     * МестнаяДата - Дата - время регистрации события СРПВ
//     * ДатаОперации - Дата - время операции по данным СРПВ
//     * Основание - ОпределяемыйТип.гкс_ДокументыСРПВ - документ регистрации собятия из СРПВ
//
Функция ДанныеОформленногоДокументаОперацииПоСтатусу(КлючАналитикиСРПВ, СтатусВагона) Экспорт
	
	Результат = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыОформленияВагонов.Документ КАК Документ,
	|	СтатусыОформленияВагонов.МестнаяДата КАК МестнаяДата,
	|	СтатусыОформленияВагонов.ДатаОперации КАК ДатаОперации,
	|	СтатусыОформленияВагонов.Основание КАК Основание
	|ИЗ
	|	РегистрСведений.гкс_СРПВСтатусыОформленияВагонов КАК СтатусыОформленияВагонов
	|ГДЕ
	|	СтатусыОформленияВагонов.КлючАналитикиСРПВ = &КлючАналитикиСРПВ
	|	И СтатусыОформленияВагонов.Статус = &Статус
	|	И СтатусыОформленияВагонов.Оформлен";
	
	Запрос.УстановитьПараметр("КлючАналитикиСРПВ", КлючАналитикиСРПВ);
	Запрос.УстановитьПараметр("Статус", СтатусВагона);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		Результат.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру данных для заполнения документа гкс_ОснованиеДляДвиженияЗапасов.
// 
// Параметры:
//  ДокументРегистрации	- ДокументСсылка.гкс_РегистрацияНаПЛК - ссылка на документ регистрации на ПЛК.
// 
// Возвращаемое значение:
//  ДанныеЗаполнения - Структура - 
//
Функция ДанныеЗаполненияОснованияДляДвиженияЗапасов(ДокументРегистрации) Экспорт
	
	ДанныеЗаполнения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РегистрацияНаПЛК.Номер КАК Номер,
		|	РегистрацияНаПЛК.Дата КАК Дата,
		|	РегистрацияНаПЛК.ТочкаМаршрута КАК ТочкаМаршрута,
		|	РегистрацияНаПЛК.ТранспортноеСредство КАК ТранспортноеСредство,
		|	РегистрацияНаПЛК.Организация КАК Организация,
		|	РегистрацияНаПЛК.Номенклатура КАК Номенклатура,
		|	РегистрацияНаПЛК.Спецификация КАК Спецификация,
		|	РегистрацияНаПЛК.Собственник КАК Собственник,
		|	НаправлениеНаРазгрузку.Склад КАК ПунктРазгрузки,
		|	СРПВПрибытиеНаПуть.ИдентификаторОтправки КАК ИдентификаторОтправки,
		|	СРПВПеревеска.ДатаТары КАК ДатаРазгрузки
		|ИЗ
		|	Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_НаправлениеНаРазгрузку КАК НаправлениеНаРазгрузку
		|		ПО РегистрацияНаПЛК.Ссылка = НаправлениеНаРазгрузку.ДокументРегистрации
		|			И (НаправлениеНаРазгрузку.Проведен)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_СРПВПрибытиеНаПуть КАК СРПВПрибытиеНаПуть
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_СРПВПеревеска КАК СРПВПеревеска
		|			ПО СРПВПрибытиеНаПуть.ИдентификаторОтправки = СРПВПеревеска.ИдентификаторОтправки
		|		ПО РегистрацияНаПЛК.ДокументОснование = СРПВПрибытиеНаПуть.Ссылка
		|ГДЕ
		|	РегистрацияНаПЛК.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументРегистрации); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеПоРегистрации = РезультатЗапроса.Выбрать();
	
	Если ДанныеПоРегистрации.Следующий() Тогда
		
		ДанныеЗаполнения.Вставить("ТипРегистрации", Перечисления.гкс_ТипРегистрации.Приемка);
		ДанныеЗаполнения.Вставить("ЭтоПриемка", Истина);
		ДанныеЗаполнения.Вставить("УсловиеПоставки", Справочники.гкс_УсловияПоставки.Приемка);
		ДанныеЗаполнения.Вставить("ВидПеревозки", Перечисления.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт);
		ДанныеЗаполнения.Вставить("Регистрация", ДокументРегистрации);
		
		ДанныеЗаполнения.Вставить("Дата", ДанныеПоРегистрации.Дата);
		ДанныеЗаполнения.Вставить("ТочкаМаршрута", ДанныеПоРегистрации.ТочкаМаршрута);
		ДанныеЗаполнения.Вставить("Организация", ДанныеПоРегистрации.Организация);
		ДанныеЗаполнения.Вставить("Номенклатура", ДанныеПоРегистрации.Номенклатура);
		ДанныеЗаполнения.Вставить("Спецификация", ДанныеПоРегистрации.Спецификация);
		
		ДанныеЗаполнения.Вставить("ПунктРазгрузки", ДанныеПоРегистрации.ПунктРазгрузки);
		ДанныеЗаполнения.Вставить("ДатаРазгрузки", ДанныеПоРегистрации.ДатаРазгрузки);
		
		ДанныеЗаполнения.Вставить("ТранспортноеСредство",	ДанныеПоРегистрации.ТранспортноеСредство);
		
		СвязьСТранспортнымДокументом = РегистрыСведений.гкс_СвязьРегистрацииИТранспортногоДокумента
		.ПолучитьСвязьСТранспортнымДокументом(ДокументРегистрации);
		
		ДанныеЗаполнения.Вставить("ТранспортныйДокумент",	СвязьСТранспортнымДокументом.ТранспортныйДокумент);
		
		Если ЗначениеЗаполнено(СвязьСТранспортнымДокументом.ТранспортныйДокумент) Тогда 
			ДатыТранспортного = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
								СвязьСТранспортнымДокументом.ТранспортныйДокумент, "ДатаПогрузки");
								
			ДанныеЗаполнения.Вставить("ДатаПогрузки", ДатыТранспортного.ДатаПогрузки);
		КонецЕсли;
		
		// Определение стратегии поиска на основе функциональной опции
		ПередаватьКачествоВходногоКонтроля = ПолучитьФункциональнуюОпцию("гкс_ПередаватьКачествоВходногоКонтроля");
		
		Если ПередаватьКачествоВходногоКонтроля Тогда
			// Стратегия поиска для входного контроля
			НазначениеИспользованияКачества = Перечисления.гкс_НазначенияИспользованияКачества.Приемка;
		Иначе
			// Стратегия поиска для композитного анализа  
			НазначениеИспользованияКачества = Перечисления.гкс_НазначенияИспользованияКачества.ПриемкаКомпозит;
		КонецЕсли;
		
		ДанныеЗаполнения.Вставить("ЛабораторныйАнализ", 
			гкс_ПриемкаТранспорта.ОпределитьЛабораторныйАнализ(ДокументРегистрации, НазначениеИспользованияКачества));
		
		Если ТипЗнч(ДанныеПоРегистрации.Собственник) = Тип("СправочникСсылка.Организации")	Тогда
			
			ДанныеЗаполнения.Вставить("Собственник", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				ДанныеПоРегистрации.Собственник, "КонтрагентОрганизации"));
		Иначе									                          
			ДанныеЗаполнения.Вставить("Собственник", ДанныеПоРегистрации.Собственник);
		КонецЕсли;
			
		ДанныеПоВесу = гкс_ПриемкаНаПЛКСервер.ПоказанияВесовПоРегистрации(ДокументРегистрации);
	
		ДанныеЗаполнения.Вставить("ВесБрутто", ДанныеПоВесу.БруттоДок);
		ДанныеЗаполнения.Вставить("ВесБруттоФакт", ДанныеПоВесу.БруттоФакт);
		ДанныеЗаполнения.Вставить("ВесНетто", ДанныеПоВесу.НеттоДок);
		ДанныеЗаполнения.Вставить("ВесНеттоФакт", ДанныеПоВесу.НеттоФакт);
		ДанныеЗаполнения.Вставить("ВесТары", ДанныеПоВесу.ТараДок);
		ДанныеЗаполнения.Вставить("ВесТарыФакт", ДанныеПоВесу.ТараФакт);  
			
	КонецЕсли;

	Возврат ДанныеЗаполнения;
	
КонецФункции

// Определяет дату начала видимости поступивших вагонов
// 
// Параметры:
//  - ДатаОтсчета - Дата - дата от которой отсчитывать
// 
// Возвращаемое значение:
//    - Дата 	- дата начала видимости поступивших вагонов	
//
Функция ДатаНачалаВидимостиПрибывшихВагонов(ДатаОтсчета = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(ДатаОтсчета) Тогда
		ДатаОтсчета = ТекущаяДатаСеанса();
	КонецЕсли;	
	
	КоличествоДнейВидимости = Константы.гкс_КоличествоДнейВидимостиПрибывшихВагонов.Получить();
	ПриращениеСекунд = КоличествоДнейВидимости * гкс_ОбщегоНазначенияКлиентСервер.СекундВДне();
	ДатаНачалаВидимости = ДатаОтсчета - ПриращениеСекунд;
			
	Возврат гкс_ПриемкаТранспорта.ДатаНачалаПроизводственныхСуток(ДатаНачалаВидимости);
	
КонецФункции

// <ДобавитьЗаписьВыгруженДляУбывшихВагонов>
//
// Параметры:
//  <ДокументыРегистрации> 	- Неопределено - выполняется обработка по всем документам с отборами по дате и типу регистрации 
//							- Массив - выполняется обработка по значениям в массиве
//							- СписокЗначений - выполняется обработка по значениям в списке значений
// Гкс+[GKSTCPLK-2347] Пилицын Н.Ю. от 03.04.2026 Добавлено:
Процедура ДобавитьЗаписьВыгруженДляУбывшихВагонов(Знач ДокументыРегистрации = Неопределено) Экспорт

	ПоВсемДокументам = ДокументыРегистрации = Неопределено;
	
	ТипДокументыРегистрации = ТипЗнч(ДокументыРегистрации);
	
	Если ТипДокументыРегистрации = Тип("Массив") Тогда
		ДокументыРегистрации = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ДокументыРегистрации);		
	ИначеЕсли ТипДокументыРегистрации = Тип("СписокЗначений") Тогда
		ДокументыРегистрации = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ДокументыРегистрации.ВыгрузитьЗначения());
	ИначеЕсли Не ПоВсемДокументам Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерСостоянияРегистрации 	= Перечисления.гкс_СостоянияРегистрации;
	МенеджерТипРегистрации			= Перечисления.гкс_ТипРегистрации;
	МенеджерСтатусыОформления		= Перечисления.гкс_СРПВСтатусыВагонов;
	МенеджерРССтатусыОформления		= РегистрыСведений.гкс_СРПВСтатусыОформленияВагонов;
    МенеджерРССостоянияРегистрации	= РегистрыСведений.гкс_СостоянияРегистрации;
	СостоянияРегистрацииПолноеИмя	= Метаданные.РегистрыСведений.гкс_СостоянияРегистрации.ПолноеИмя();
	
	КодОсновногоЯзыка	= ОбщегоНазначения.КодОсновногоЯзыка();
	ТекущийПользователь	= Пользователи.ТекущийПользователь();
	
	ТекстЗапроса = ТекстЗапросаУбылНоНеВыгружен();
	
	Если ПоВсемДокументам Тогда
		УсловиеОтбораДокументРегистрации = "гкс_СостоянияРегистрации.ДокументРегистрации.Дата >= &НачальнаяДата
								|	И гкс_СостоянияРегистрации.ДокументРегистрации.ТипРегистрации = &ТипРегистрации";		
	Иначе	
		УсловиеОтбораДокументРегистрации = "гкс_СостоянияРегистрации.ДокументРегистрации В (&ДокументыРегистрации)";		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОтбораДокументРегистрации", УсловиеОтбораДокументРегистрации);
	
	НачальнаяДата = гкс_УчетВагоновСРПВ.ДатаНачалаВидимостиПрибывшихВагонов();
	
	СостояниеРегистрацииВыгружен = МенеджерСостоянияРегистрации.Выгружен;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("СостояниеВыгружен", 			СостояниеРегистрацииВыгружен);
	Запрос.УстановитьПараметр("СостояниеВыгрузкаРазрешена", МенеджерСостоянияРегистрации.ВыгрузкаРазрешена);
	Запрос.УстановитьПараметр("СостояниеУбыл", 				МенеджерСостоянияРегистрации.Убыл);
	Запрос.УстановитьПараметр("НачальнаяДата", 				НачальнаяДата);
	Запрос.УстановитьПараметр("ТипРегистрации", 			МенеджерТипРегистрации.Приемка);
	Запрос.УстановитьПараметр("ДокументыРегистрации", 		ДокументыРегистрации); 
	Запрос.УстановитьПараметр("СтатусОформленияВыгружен",	МенеджерСтатусыОформления.Выгружен);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		РазницаДатВСекундах = Выборка.РазницаМеждуВыгрузкаРазрешенаИУбытием;
		
		Если РазницаДатВСекундах <= 1 Тогда
			//Не можем добавить запись между двумя событиями		
			ТекстШаблона = НСтр("ru='Невозможно добавить запись в %1'", КодОсновногоЯзыка);		
			ТекстСообщения = СтрШаблон(ТекстШаблона, СостоянияРегистрацииПолноеИмя);
			СобытиеЖР = НСтр("ru='СРПВ: Обновление данных состояний регистрации'", КодОсновногоЯзыка);
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(СобытиеЖР, 
														УровеньЖурналаРегистрации.Предупреждение,
														Метаданные.РегистрыСведений.гкс_СостоянияРегистрации,
														Выборка.ДокументРегистрации,
														ТекстСообщения);
			Продолжить;		
		КонецЕсли;
								
		ПериодУбытия 				= Выборка.ПериодУбытия;
		ПериодВыгрузкаРазрешена 	= Выборка.ПериодВыгрузкаРазрешена;
		ЧасовойПоясТочкиМаршрута 	= Выборка.ЧасовойПоясТочкиМаршрута;
		ОднаСекунда 				= 1;
			
		ПериодЗаписи				= ПериодВыгрузкаРазрешена + ОднаСекунда;
		
		ОписаниеСостояния = МенеджерРССостоянияРегистрации.СтруктураЗаписи();
		
		ЗаполнитьЗначенияСвойств(ОписаниеСостояния, Выборка);
		
		ОписаниеСостояния.Состояние 	= СостояниеРегистрацииВыгружен;
		ОписаниеСостояния.Комментарий	= "";
		ОписаниеСостояния.Период		= ПериодЗаписи;
		ОписаниеСостояния.МестнаяДата	= МестноеВремя(ПериодЗаписи, ЧасовойПоясТочкиМаршрута);   
		ОписаниеСостояния.Пользователь	= ТекущийПользователь;
		
		гкс_ПриемкаТранспорта.ЗарегистрироватьНовоеСостояниеПоПараметрам(ОписаниеСостояния);		
				
		МенеджерРССтатусыОформления.ОтразитьСвязьСДокументомСРПВ(Выборка.КлючАналитикиСРПВ, 
													МенеджерСтатусыОформления.Выгружен, Выборка.ДокументРегистрации);			
	КонецЦикла;

КонецПроцедуры// Гкс-[GKSTCPLK-2347] Пилицын Н.Ю. от 03.04.2026

#Область Проведение

// Формирует параметры для проведения документа по регистрам учетного механизма через общий механизм проведения.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  Свойства - ФиксированнаяСтруктура - свойства документа (См. гкс_ПроведениеДокументов.СвойстваДокумента).
//
// Возвращаемое значение:
//  Структура - со свойствами:
//     * НезависимыеРегистры - Массив Из ОбъектМетаданныхРегистрСведений -
//     * ПодчиненныеРегистры - Массив Из ОбъектМетаданныхРегистрСведений -
//                           - Массив Из ОбъектМетаданныхРегистрНакопления -
//                           - Массив Из ОбъектМетаданныхРегистрБухгалтерии -
//                           - Массив Из ОбъектМетаданныхРегистрРасчета  - список подчиненных регистратору регистров, который записываются учетным механизмом.
//     * КонтрольныеРегистрыИзменений - Массив Из ОбъектМетаданныхРегистрСведений -
//                                    - Массив Из ОбъектМетаданныхРегистрНакопления -
//                                    - Массив Из ОбъектМетаданныхРегистрБухгалтерии -
//                                    - Массив Из ОбъектМетаданныхРегистрРасчета - список подчиненных регистратору регистров,
//                                                                                 по которым необходимо контролировать изменения.
//     * КонтрольныеРегистрыЗаданий - Массив Из ОбъектМетаданныхРегистрСведений -
//                                  - Массив Из ОбъектМетаданныхРегистрНакопления -
//                                  - Массив Из ОбъектМетаданныхРегистрБухгалтерии -
//                                  - Массив Из ОбъектМетаданныхРегистрРасчета - список подчиненных регистратору регистров,
//                                                                               по изменению которых необходимо формировать задания.
//     * КонтрольныеРегистрыДатаЗапрета - Массив Из ОбъектМетаданныхРегистрСведений -
//                                  - Массив Из ОбъектМетаданныхРегистрНакопления -
//                                  - Массив Из ОбъектМетаданныхРегистрБухгалтерии -
//                                  - Массив Из ОбъектМетаданныхРегистрРасчета - список регистров, по которым необходимо проверить дату
//                                                                              запрета изменений с помощью таблицы изменений.
//     * ЕстьПроизводныеДвижения - Булево - формируются вторичные движения используя данные уже записанных регистров,
//                                          сделанных в том числе другими механизмами.
//
//
Функция ПараметрыДляПроведенияДокумента(Документ, Свойства) Экспорт
	
	Параметры = гкс_ПроведениеДокументов.ПараметрыУчетногоМеханизма();  
	
	Параметры.НезависимыеРегистры.Добавить(Метаданные.РегистрыСведений.гкс_СРПВСтатусыОформленияВагонов);
	Параметры.НезависимыеРегистры.Добавить(Метаданные.РегистрыСведений.гкс_СРПВТранспортныеДокументыЖДПолученные);
	
	Возврат Параметры;
	
КонецФункции

// Процедура формирования движений по подчиненным регистрам.
//
// Параметры:
//   ТаблицыДляДвижений - Структура - таблицы данных документа
//   Движения - КоллекцияДвижений - коллекция наборов записей движений документа
//   Отказ - Булево - признак отказа от проведения документа.
//
Процедура ОтразитьДвижения(ТаблицыДляДвижений, Движения, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Возникает перед выполнением записи регистров документа.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц,
//								используемый для хранения таблиц контроля изменений регистров.
//  Отказ - Булево - признак отказа от проведения документа.
//
Процедура ПередЗаписьюДвиженийДокумента(Документ, МенеджерВременныхТаблиц, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Возникает после выполнения записи регистров документа.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц,
//								используемый для хранения таблиц контроля изменений регистров.
//  Отказ - Булево - признак отказа от проведения документа.
//
Процедура ПослеЗаписиДвиженийДокумента(Документ, МенеджерВременныхТаблиц, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоОтменаПроведенияДокумента = Документ.ДополнительныеСвойства.ПроведениеДокументов
				   .СвойстваДокумента.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;	 
	 
КонецПроцедуры

// Процедура формирования движений по независимым регистрам.
//
// Параметры:
//	ТаблицыДляДвижений - Структура - таблицы данных документа
//	Документ - ДокументСсылка - ссылка на документ
//	Отказ - Булево - признак отказа от проведения документа.
//
Процедура ЗаписатьДанные(ТаблицыДляДвижений, Документ, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
		
	Если ТаблицыДляДвижений.Свойство("Таблицагкс_СРПВТранспортныеДокументыЖДПолученные") 
		И ЗначениеЗаполнено(ТаблицыДляДвижений.Таблицагкс_СРПВТранспортныеДокументыЖДПолученные) Тогда
		
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.гкс_РегистрацияНаПЛК") Тогда
			
			Реквизиты = Новый Структура;
			Реквизиты.Вставить(
				"Прибытие", 
				"ВЫРАЗИТЬ(ДокументОснование КАК Документ.гкс_СРПВПрибытиеНаПуть)");
			Реквизиты.Вставить(
				"КлючАналитикиСРПВ", 
				"ВЫРАЗИТЬ(ДокументОснование КАК Документ.гкс_СРПВПрибытиеНаПуть).ИдентификаторОтправки");
			
		Иначе // гкс_СРПВПрибытиеНаПуть
			
			Реквизиты = Новый Структура;
			Реквизиты.Вставить("Прибытие"			, "Ссылка");
			Реквизиты.Вставить("КлючАналитикиСРПВ"	, "ИдентификаторОтправки");
			
		КонецЕсли;
		
		Отбор = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, Реквизиты);
		Набор = РегистрыСведений.гкс_СРПВТранспортныеДокументыЖДПолученные.СоздатьНаборЗаписей();
		Набор.Отбор.Прибытие.Установить(Отбор.Прибытие);
		Набор.Отбор.КлючАналитикиСРПВ.Установить(Отбор.КлючАналитикиСРПВ);
		Набор.Загрузить(ТаблицыДляДвижений["Таблицагкс_СРПВТранспортныеДокументыЖДПолученные"]);
		Набор.Записать();

	КонецЕсли;
		
	Если ТаблицыДляДвижений.Свойство("Таблицагкс_СРПВСтатусыОформленияВагонов") Тогда  
		
		КлючАналитикиСРПВ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "ИдентификаторОтправки");
			
		Набор = РегистрыСведений.гкс_СРПВСтатусыОформленияВагонов.СоздатьНаборЗаписей();
		Набор.Отбор.КлючАналитикиСРПВ.Установить(КлючАналитикиСРПВ);
		Набор.Отбор.Основание.Установить(Документ);
		Набор.Загрузить(ТаблицыДляДвижений["Таблицагкс_СРПВСтатусыОформленияВагонов"]);
		Набор.Записать();
		
	КонецЕсли;
		
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Актуализирует связанные документы взвешивания при изменении весов в документе СРПВ перевески.
//
// Параметры:
//  ИдентификаторОтправки - СправочникСсылка.гкс_КлючиАналитикиСРПВ - идентификатор отправки СРПВ
//  ВесБрутто - Число - вес брутто
//  ДатаБрутто - Дата - дата взвешивания брутто
//  ВесТары - Число - вес тары
//  ДатаТары - Дата - дата взвешивания тары
//
Процедура АктуализироватьСвязанныеВзвешивания(ИдентификаторОтправки, ВесБрутто, ДатаБрутто, ВесТары, ДатаТары) Экспорт
	
	// Найти связанные документы взвешивания через регистр статусов СРПВ
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтатусыОформления.Документ КАК ДокументВзвешивания,
		|	СтатусыОформления.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.гкс_СРПВСтатусыОформленияВагонов КАК СтатусыОформления
		|ГДЕ
		|	СтатусыОформления.КлючАналитикиСРПВ = &ИдентификаторОтправки
		|	И СтатусыОформления.Статус В (&СтатусыВзвешивания)
		|	И ТИПЗНАЧЕНИЯ(СтатусыОформления.Документ) = ТИП(Документ.гкс_Взвешивание)";
	
	СтатусыВзвешивания = Новый Массив;
	СтатусыВзвешивания.Добавить(Перечисления.гкс_СРПВСтатусыВагонов.ВзвешенБрутто);
	СтатусыВзвешивания.Добавить(Перечисления.гкс_СРПВСтатусыВагонов.ВзвешенТара);
	
	Запрос.УстановитьПараметр("ИдентификаторОтправки", ИдентификаторОтправки);
	Запрос.УстановитьПараметр("СтатусыВзвешивания", СтатусыВзвешивания);
	
	Результат = Запрос.Выполнить();
	
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДокументВзвешивания = Выборка.ДокументВзвешивания;
		СтатусВзвешивания = Выборка.Статус;
		
		Попытка
			ОбъектВзвешивания = ДокументВзвешивания.ПолучитьОбъект();
			
			Если ОбъектВзвешивания = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			// Получаем параметры обновления веса
			ПараметрыОбновления = ПараметрыОбновленияВесаПоСтатусу(СтатусВзвешивания,
					ВесБрутто, ДатаБрутто, ВесТары, ДатаТары);
			
			Если ПараметрыОбновления = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			// Обновляем вес и дату
			ОбъектВзвешивания.Вес = ПараметрыОбновления.Вес;
			ОбъектВзвешивания.МестнаяДата = ПараметрыОбновления.Дата;
			
			// Записываем обновленный документ взвешивания
			ОбъектВзвешивания.Записать(РежимЗаписиДокумента.Проведение);
			
		Исключение
			
			// Логируем ошибку, но не прерываем процесс
			СведенияОбОшибке = ИнформацияОбОшибке();
			ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(СведенияОбОшибке);
			ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Ошибка актуализации документа взвешивания %1 из СРПВ перевески: %2'"),
					ДокументВзвешивания,
					ПредставлениеОшибки);
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
				НСтр("ru = 'СРПВ.Актуализация взвешиваний'"), УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Документы.гкс_СРПВПеревеска, , ТекстОшибки);
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииРегламетныхЗаданий

// Метод вызывается из регламентного задания "СРПВ: Обработка вагонов без регистрации".
Процедура ОтложенноеСозданиеДокументовПЛК() Экспорт
	
	РегламентноеЗадание = Метаданные.РегламентныеЗадания.гкс_СРПВСозданиеДоументов;
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(РегламентноеЗадание);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'СРПВ: Создание документов по сообщениям СРПВ'",
		ОбщегоНазначения.КодОсновногоЯзыка()),
    	УровеньЖурналаРегистрации.Информация, , ,
    	НСтр("ru = 'Начато регламентное задание создания документов по сообщениям СРПВ.'"));
		
	СоздатьДокументыПоСтатусу(Перечисления.гкс_СРПВСтатусыВагонов.Прибыл);
	СоздатьДокументыПоСтатусу(Перечисления.гкс_СРПВСтатусыВагонов.ВзвешенБрутто);
	СоздатьДокументыПоСтатусу(Перечисления.гкс_СРПВСтатусыВагонов.Выгружен);
	СоздатьДокументыПоСтатусу(Перечисления.гкс_СРПВСтатусыВагонов.ВзвешенТара);
	// Гкс+[GKSTCPLK-2347] Пилицын Н.Ю. от 03.04.2026 Добавлено:
	ОбновитьДанныеСостоянияРегистрации();     
	// Гкс-[GKSTCPLK-2347] Пилицын Н.Ю. от 03.04.2026
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'СРПВ: Создание документов по сообщениям СРПВ'", 
		ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Информация, , ,
	    НСтр("ru = 'Закончено регламентное задание создания документов по сообщениям СРПВ.'"));	
				
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьДокументыПоСтатусу(Статус)
	
	НачатьТранзакцию();
	Попытка
		
		Выборка = ВыбратьНеоформленныеДокументыПоСтатусу(Статус);
		Пока Выборка.Следующий() Цикл
						
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			Если Статус = Перечисления.гкс_СРПВСтатусыВагонов.Прибыл Тогда
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Иначе	
				ДокументОбъект.СформироватьДокументПЛКПриНеобходимости(Статус);
			КонецЕсли;	
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'СРПВ: Создание документов по сообщениям СРПВ'", 
			ОбщегоНазначения.КодОсновногоЯзыка()),
		    УровеньЖурналаРегистрации.Ошибка, , ,
		    НСтр("ru = 'Во время регламентного создания документов по сообщениям СРПВ произошла ошибка.'")
		    + Символы.ПС + ПодробноеПредставлениеОшибки);
		Возврат;
		
	КонецПопытки;
	
КонецПроцедуры

// Гкс+[GKSTCPLK-2347] Пилицын Н.Ю. от 03.04.2026 Добавлено:
Процедура ОбновитьДанныеСостоянияРегистрации()

	НачатьТранзакцию();
	Попытка
		ДобавитьЗаписьВыгруженДляУбывшихВагонов();
		ЗафиксироватьТранзакцию();	
	Исключение
	 	ОтменитьТранзакцию();
		
		ТекстШаблона = НСтр("ru = 'Не удалось привязать документы регистрации на ПЛК к документу СРПВ по причине: %1'", 
						ОбщегоНазначения.КодОсновногоЯзыка());
		
		ТекстСообщения = СтрШаблон(ТекстШаблона, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		СобытиеЖР = НСтр("ru='СРПВ: Обновление данных состояний регистрации'", ОбщегоНазначения.КодОсновногоЯзыка());	
			
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(СобытиеЖР, 
														УровеньЖурналаРегистрации.Ошибка,
														Метаданные.РегистрыСведений.гкс_СостоянияРегистрации,
														,
														ТекстСообщения);
	КонецПопытки;		

КонецПроцедуры// Гкс-[GKSTCPLK-2347] Пилицын Н.Ю. от 03.04.2026 Добавлено:

// Гкс+[GKSTCPLK-2347] Пилицын Н.Ю. от 03.04.2026 Добавлено:
Функция ТекстЗапросаУбылНоНеВыгружен()

	ТекстЗапроса = "ВЫБРАТЬ
	               |	гкс_СостоянияРегистрации.ДокументРегистрации КАК ДокументРегистрации,
	               |	МАКСИМУМ(гкс_СостоянияРегистрации.Период) КАК ПериодУбытия
	               |ПОМЕСТИТЬ втСостоянияУбыл
	               |ИЗ
	               |	РегистрСведений.гкс_СостоянияРегистрации КАК гкс_СостоянияРегистрации
	               |ГДЕ
	               |	&УсловиеОтбораДокументРегистрации
	               |	И гкс_СостоянияРегистрации.Состояние = &СостояниеУбыл
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	гкс_СостоянияРегистрации.ДокументРегистрации
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ДокументРегистрации
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	гкс_СостоянияРегистрации.ДокументРегистрации КАК ДокументРегистрации,
	               |	МАКСИМУМ(гкс_СостоянияРегистрации.Период) КАК ПериодВыгрузкаРазрешена
	               |ПОМЕСТИТЬ втСостоянияВыгрузкаРазрешена
	               |ИЗ
	               |	РегистрСведений.гкс_СостоянияРегистрации КАК гкс_СостоянияРегистрации
	               |ГДЕ
	               |	&УсловиеОтбораДокументРегистрации
	               |	И гкс_СостоянияРегистрации.Состояние = &СостояниеВыгрузкаРазрешена
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	гкс_СостоянияРегистрации.ДокументРегистрации
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ДокументРегистрации
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	гкс_СостоянияРегистрации.ДокументРегистрации КАК ДокументРегистрации,
	               |	МАКСИМУМ(гкс_СостоянияРегистрации.Период) КАК ПериодУбытия
	               |ПОМЕСТИТЬ втСостоянияВыгружен
	               |ИЗ
	               |	РегистрСведений.гкс_СостоянияРегистрации КАК гкс_СостоянияРегистрации
	               |ГДЕ
	               |	&УсловиеОтбораДокументРегистрации
	               |	И гкс_СостоянияРегистрации.Состояние = &СостояниеВыгружен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	гкс_СостоянияРегистрации.ДокументРегистрации
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ДокументРегистрации
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	гкс_СРПВСтатусыОформленияВагонов.КлючАналитикиСРПВ КАК КлючАналитикиСРПВ,
	               |	ВЫРАЗИТЬ(гкс_СРПВСтатусыОформленияВагонов.Документ КАК Документ.гкс_РегистрацияНаПЛК) КАК Документ
	               |ПОМЕСТИТЬ втСтатусыОформленияВагонов
	               |ИЗ
	               |	РегистрСведений.гкс_СРПВСтатусыОформленияВагонов КАК гкс_СРПВСтатусыОформленияВагонов
	               |ГДЕ
	               |	гкс_СРПВСтатусыОформленияВагонов.Статус = &СтатусОформленияВыгружен
	               |	И гкс_СРПВСтатусыОформленияВагонов.Документ В
	               |			(ВЫБРАТЬ
	               |				втСостоянияВыгрузкаРазрешена.ДокументРегистрации КАК ДокументРегистрации
	               |			ИЗ
	               |				втСостоянияВыгрузкаРазрешена КАК втСостоянияВыгрузкаРазрешена
	               |		
	               |			ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |			ВЫБРАТЬ
	               |				втСостоянияУбыл.ДокументРегистрации
	               |			ИЗ
	               |				втСостоянияУбыл КАК втСостоянияУбыл)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Документ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втСостоянияУбыл.ДокументРегистрации КАК ДокументРегистрации,
	               |	втСостоянияВыгрузкаРазрешена.ПериодВыгрузкаРазрешена КАК ПериодВыгрузкаРазрешена,
	               |	втСостоянияУбыл.ПериодУбытия КАК ПериодУбытия,
	               |	втСтатусыОформленияВагонов.КлючАналитикиСРПВ КАК КлючАналитикиСРПВ,
	               |	втСостоянияУбыл.ДокументРегистрации.ТипРегистрации КАК ТипРегистрации,
	               |	втСостоянияУбыл.ДокументРегистрации.ТочкаМаршрута КАК ТочкаМаршрута,
	               |	втСостоянияУбыл.ДокументРегистрации.ТранспортноеСредство КАК ТранспортноеСредство,
	               |	втСостоянияУбыл.ДокументРегистрации.ВидПеревозки КАК ВидПеревозки,
	               |	ЕСТЬNULL(втСостоянияУбыл.ДокументРегистрации.ТочкаМаршрута.гкс_ЧасовойПоясТочкиМаршрута, """") КАК ЧасовойПоясТочкиМаршрута,
	               |	РАЗНОСТЬДАТ(втСостоянияВыгрузкаРазрешена.ПериодВыгрузкаРазрешена, втСостоянияУбыл.ПериодУбытия, СЕКУНДА) КАК РазницаМеждуВыгрузкаРазрешенаИУбытием
	               |ИЗ
	               |	втСостоянияУбыл КАК втСостоянияУбыл
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втСостоянияВыгружен КАК втСостоянияВыгружен
	               |		ПО втСостоянияУбыл.ДокументРегистрации = втСостоянияВыгружен.ДокументРегистрации
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСостоянияВыгрузкаРазрешена КАК втСостоянияВыгрузкаРазрешена
	               |		ПО втСостоянияУбыл.ДокументРегистрации = втСостоянияВыгрузкаРазрешена.ДокументРегистрации
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСтатусыОформленияВагонов КАК втСтатусыОформленияВагонов
	               |		ПО втСостоянияУбыл.ДокументРегистрации = втСтатусыОформленияВагонов.Документ
	               |ГДЕ
	               |	втСостоянияВыгружен.ДокументРегистрации ЕСТЬ NULL";
	
	Возврат ТекстЗапроса;

КонецФункции// Гкс-[GKSTCPLK-2347] Пилицын Н.Ю. от 03.04.2026

Функция ВыбратьНеоформленныеДокументыПоСтатусу(Статус)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтатусыОформленияВагонов.Основание КАК Ссылка,
	|	СтатусыОформленияВагонов.КлючАналитикиСРПВ КАК КлючАналитикиСРПВ
	|ИЗ
	|	РегистрСведений.гкс_СРПВСтатусыОформленияВагонов КАК СтатусыОформленияВагонов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СРПВТранспортныеДокументыЖДПолученные КАК ТранспортныеДокументыЖДПолученные
	|		ПО СтатусыОформленияВагонов.КлючАналитикиСРПВ = ТранспортныеДокументыЖДПолученные.КлючАналитикиСРПВ
	|			И ТранспортныеДокументыЖДПолученные.ДатаПрибытия >= &ОграничениеНаДатуПрибытия
	|ГДЕ
	|	СтатусыОформленияВагонов.Оформлен = ЛОЖЬ
	|	И СтатусыОформленияВагонов.Статус = &Статус";
	
	Запрос.УстановитьПараметр("Статус", Статус);
	Запрос.УстановитьПараметр("ОграничениеНаДатуПрибытия", гкс_УчетВагоновСРПВ.ДатаНачалаВидимостиПрибывшихВагонов());
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Выбрать();
	
КонецФункции

// Проверяет оформленность реестра ЗПП-3 для документа регистрации.
//
// Параметры:
//  ДокументРегистрации	- ДокументСсылка.гкс_РегистрацияНаПЛК - ссылка на документ регистрации на ПЛК.
//
// Возвращаемое значение:
//  Булево - Истина, если реестр ЗПП-3 оформлен.
//
Функция РеестрЗПП3ОформленДляДокумента(ДокументРегистрации) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокументРегистрации) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеестрНакладныхЗПП3.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.гкс_РеестрНакладныхЗПП3 КАК РеестрНакладныхЗПП3
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РеестрНакладныхЗПП3.Накладные КАК РеестрНакладные
		|		ПО РеестрНакладныхЗПП3.Ссылка = РеестрНакладные.Ссылка
		|		И РеестрНакладные.ДокументРегистрации = &ДокументРегистрации
		|ГДЕ
		|	РеестрНакладныхЗПП3.Проведен";
	
	Запрос.УстановитьПараметр("ДокументРегистрации", ДокументРегистрации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
КонецФункции

// Параметры обновления веса по статусу.
//
// Параметры:
//  СтатусВзвешивания - ПеречислениеСсылка.гкс_СРПВСтатусыВагонов - статус взвешивания
//  ВесБрутто - Число - вес брутто
//  ДатаБрутто - Дата - дата взвешивания брутто
//  ВесТары - Число - вес тары
//  ДатаТары - Дата - дата взвешивания тары
//
// Возвращаемое значение:
//  Структура, Неопределено - Параметры обновления веса по статусу:
// * Вес - Число
// * Дата - Дата
//
Функция ПараметрыОбновленияВесаПоСтатусу(СтатусВзвешивания, ВесБрутто, ДатаБрутто, ВесТары, ДатаТары)
	РезультатОбновления = Неопределено;
	
	Если СтатусВзвешивания = Перечисления.гкс_СРПВСтатусыВагонов.ВзвешенБрутто
		И ВесЗаполнен(ВесБрутто, ДатаБрутто) Тогда 

		РезультатОбновления = ПараметрыОбновления(ВесБрутто, ДатаБрутто);
		
	ИначеЕсли СтатусВзвешивания = Перечисления.гкс_СРПВСтатусыВагонов.ВзвешенТара
		И ВесЗаполнен(ВесТары, ДатаТары) Тогда 

		РезультатОбновления = ПараметрыОбновления(ВесТары, ДатаТары);

	КонецЕсли;

	Возврат РезультатОбновления;
	
КонецФункции

// Проверяет заполнены ли вес и дата взвешивания.
//
// Параметры:
//  Вес - Число - вес (брутто или тары)
//  ДатаВеса - Дата - дата взвешивания
//
// Возвращаемое значение:
//  Булево - Истина, если вес и дата заполнены
//
Функция ВесЗаполнен(Вес, ДатаВеса)
	
	Возврат ЗначениеЗаполнено(Вес) И ЗначениеЗаполнено(ДатаВеса);
	
КонецФункции

// Создает структуру параметров обновления веса или возвращает Неопределено.
//
// Параметры:
//  Вес - Число - значение веса (необязательный, по умолчанию Неопределено)
//  Дата - Дата - дата взвешивания (необязательный, по умолчанию Неопределено)
//
// Возвращаемое значение:
//  Структура - структура с полями "Вес, Дата"
//
Функция ПараметрыОбновления(Вес, Дата)

	Возврат Новый Структура("Вес, Дата", Вес, Дата);
	
КонецФункции

#КонецОбласти
